[
    {
        "url": "https://www.nitt.edu/",
        "text_content": "Placements Library Departments Events CC Translate Webmail Sitemap Dashboard View Login Register Search Select Language Afrikaans Albanian Amharic Arabic Armenian Azerbaijani Basque Belarusian Bengali Bosnian Bulgarian Catalan Cebuano Chichewa Chinese (Simplified) Chinese (Traditional) Corsican Croatian Czech Danish Dutch Esperanto Estonian Filipino Finnish French Frisian Galician Georgian German Greek Gujarati Haitian Creole Hausa Hawaiian Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Kazakh Khmer Korean Kurdish (Kurmanji) Kyrgyz Lao Latin Latvian Lithuanian Luxembourgish Macedonian Malagasy Malay Malayalam Maltese Maori Marathi Mongolian Myanmar (Burmese) Nepali Norwegian Pashto Persian Polish Portuguese Punjabi Romanian Russian Samoan Scots Gaelic Serbian Sesotho Shona Sindhi Sinhala Slovak Slovenian Somali Spanish Sundanese Swahili Swedish Tajik Tamil Telugu Thai Turkish Ukrainian Urdu Uzbek Vietnamese Welsh Xhosa Yiddish Yoruba Zulu Toggle navigation Home About Us Administration Academic Admission Departments / Centres Departments / Centres Architecture CECASE Chemical Engineering Chemistry Civil Engineering Computer Applications Computer Science & Engineering DEE Electrical & Electronics Engineering Electronics & Communication Engineering Humanities and Social Sciences Instrumentation & Control Engineering Management Studies Mathematics Mechanical Engineering Metallurgical & Materials Engineering Physics Production Engineering Centres/Common facility Central Workshop Computer Support Group Estate Maintenance Guest House Hospital Campus Communication Services Hostels Lecture Hall Complex/Orion First Year Coordinator Office Library Security CoE in Manufacturing CEDI Sophisticated Instrumentation Facility Physical Education / Sports Center Training and Placement Transport Departments Research & Consultancy Important Links Placements Sitemap Webmail Search Congratulations to our B.Tech Students for receiving prestigious Mitacs Globalink Research Internship 2024.... NIRF 2023 - First among NITs, Ninth in Engineering.... Certificate of Appreciation - NIPAM 2022....F NIT-T appointed as the National MOOCs Coordinator for offering Engineering Courses at UG & PG level by MHRD, GOI.... NIT, Tiruchirapalli gets Prime Minister's Research Fellowship (PMRF) Scheme .... For skill hub courses and applications https://skillhub.nitt.edu/ .... NIT-T Ambulance 9486001162 ... NIT-T Hospital 91-431-2503860... NIT-T Security Office 9486001168 / 91-431-2503900... Anti-Ragging Helpline Mobile Number: 9486001180 and emailD: antiragging@nitt.edu.... Internal Complaints committee to address Sexual Harassment of Women at Workplace (Prevention, Prohibition and Redressal).... Women Sexual Harassment Helpline 9486001149, email: womencell@nitt.edu.... Students Grievance Helpline Mobile Number: 9486001198 and email: studentsgrievance@nitt.edu.... One Year self supporting ONLINE Certificate Course in STEEL TECHNOLOGY (Last date extended to 8 November 2023.).... Vision To be a university globally trusted for technical excellence where learning and research integrate to sustain society and industry. Mission To offer undergraduate, postgraduate, doctoral and modular programmes in multi-disciplinary / inter-disciplinary and emerging areas. To create a converging learning environment to serve a dynamically evolving society. To promote innovation for sustainable solutions by forging global collaborations with academia and industry in cutting-edge research. To be an intellectual ecosystem where human capabilities can develop holistically. Academic/Admission Circulars Ph.D. Admissions 2024 M.S. (by Research) Admissions 2024 M.Tech./M.Arch. Admissions (CCMT 2024) M.Sc. Admissions (CCMN 2024) MBA Admissions 2024 M.A. English (Language and Literature) Admission 2024–25 B.Tech./B.Arch. Admissions (JoSAA/CSAB 2024) ITEP B.Sc. B.Ed. Admissions 2024 MCA Admissions 2024 Notices_UG / PG / Ph. D. (Registration; Assessment, Fees, Transcript, Scholarship and Stipend) Notices/Downloads Inviting applications for JRF / Project Associate in Department of Civil, June 30, 2024 NITT/R/TF/2024: Temporary Faculty Recruitment, Last Date June 28, 2024 Engagement of Visiting Consultants, June 28, 2024 Inviting applications for Project Associate in Department of ICE, June 28, 2024 Inviting applications for Project Assistant in Department of ICE, June 27, 2024 Engagement of Temporary Staff Nurse, June 24, 2024 Engagement of Temporary Legal Assistant at NIT-T Walk-In Interview on 26.06.2024 Institute Day 2024 - Photos Advertisement - Business Opportunity with CEDI EoI CALL 2024 Hostel Accommodation Request Form for Internship Students 2024-2025 RECT’78 Alumni Scholarship for the academic year 2024-2025 (SECOND YEAR B.Tech.) Invitation for Distinguished Alumni Award (DAA) - 2024: Last date of submission August 15,2024 (Word), (PDF) Invitation for Young Achiever Award (YAA) - 2024: Last date of submission August 15,2024 (Word), (PDF) Overall Outstanding Student of the year 2024 (Instituted by RECAL) NIRF 2024 List of Selected Candidates and Waitlisted Candidates for Group B and C recruitment (2023) Boeing Scholarship circular 2024 Students Finacial support AY-2023-2024 List of Holidays in the year 2024 Group C : Junior Assistant, Senior Assistant, Office Attendant, Lab Attendant Candidates provisionally shortlisted for Screening Test, Skill Test, Main Test and Schedule STUDENTS FINANCIAL SUPPORT - AY 2023-2024 Compassionate Ground Appointment — Point Based Merit System and procedure for selection Group A Deputation - List of Provisionally Selected Candidates Group A Direct Recruitment - List of Provisionally Selected Candidates Anti Ragging Committee 2023-24 Accessible India Campaign (Sugamya Bharat Abhiyan) portal CEDI - CALL for Innovative Startup IDEAs 2023-24 Notification for QIP Admission 2023-24 under AICTE scheme Hostel Accommodation Application Form One Year self supporting ONLINE Certificate Course in STEEL TECHNOLOGY Skill hub courses and applications NIT-T Students Hostel Accommodation Request Form for Internship during vacation period RECAL Alumni website Media Monitor - NEWS that appeared in print and online media Equity-Action-Plan under TEQIP Phase III Rules and Regulations for Hostels CoE in manufacturing Notifications for Ph.D Viva-Voce NITT Intellectual Property (IP) Policy NITT GST Number Quicklinks Virtual tour of NIT-T Internal Complaints committee - Sexual Harassment of Women at Workplace (Prevention, Prohibition & Redressal) Faculty Profile List of Q1 Journals as per Scimago Ranking Course Registration in MIS MIS link for Students/Scholars (Intranet), (Internet) MIS link for Staff/Faculty (Intranet), (Internet) Institute Employees Directory (last updated during June 2024) New Internal Telephone Directory (June 2024) Planning and Development Institute Development TEQIP-III Scholarship Funding Agencies, Travel Support Upcoming / On-Going Events JUN 10 Workshop on Managing Human Resources in The Digital Era and The Future of Work Organized by Department of Management Studies - June 10-14, 2024 JUN 21 One-day Workshop on Shakti RISC-V Processors Organized by Department of CSE - June 21, 2024 JUL 01 Certification Course on \"Android App Development\" Organized by Department of CSE - July 1-12, 2024 DEC 12-14 14th Structural Engineering Convention - An International Conference (SEC2024) Organized by Department of Civil Engineering, National Institute of Technology - 12th to 14th December,2024For more details visit https://sec2024.nitt.edu footer Academics Academic Programmes Departments Faculty Rules and Regulations Scholarships Admissions B.Tech / B.Arch. M.Tech / M.Arch. M.Sc MCA MBA MA MS (By Research) Ph.D. Student life Events Clubs & Associations Facilities & Services Hostel & Messes Office of the Dean (Students) Other Links Tenders and Notices Job Opportunities RTI Alumni Sitemap Contact Us National Institute of TechnologyTiruchirappalli - 620015Tamil Nadu, INDIAFax: +91-431-2500133 footer-bottom © WebTeam NIT TrichyNational Institute of Technology, Tiruchirappalli Home About Contact //<![CDATA[ jQuery(document).ready(function() { jQuery( '.ktweet .kfooter a:not(.ktogglemedia)' ).click(function(e) { // Prevent Click from Reloading page e.preventDefault(); var khref = jQuery(this).attr('href'); window.open( khref, 'twitter', 'width=600, height=400, top=0, left=0'); }); }); //]]>"
    }
]